RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/include/gpio_psoc6_02_100_wlcsp.h
    /* P12.6 */
    P12_6_GPIO                      =  0,       /* GPIO controls 'out' */
    P12_6_AMUXA                     =  4,       /* Analog mux bus A */
    P12_6_AMUXB                     =  5,       /* Analog mux bus B */
    P12_6_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P12_6_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P12_6_TCPWM0_LINE7              =  8,       /* Digital Active - tcpwm[0].line[7]:3 */
    P12_6_TCPWM1_LINE7              =  9,       /* Digital Active - tcpwm[1].line[7]:1 */
    P12_6_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:91 */
    P12_6_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:91 */
    P12_6_LCD_COM29                 = 12,       /* Digital Deep Sleep - lcd.com[29]:1 */
    P12_6_LCD_SEG29                 = 13,       /* Digital Deep Sleep - lcd.seg[29]:1 */
    P12_6_SCB6_SPI_SELECT3          = 20,       /* Digital Active - scb[6].spi_select3:0 */
    P12_6_SDHC1_CARD_IF_PWR_EN      = 26,       /* Digital Active - sdhc[1].card_if_pwr_en */

    /* P12.7 */
    P12_7_GPIO                      =  0,       /* GPIO controls 'out' */
    P12_7_AMUXA                     =  4,       /* Analog mux bus A */
    P12_7_AMUXB                     =  5,       /* Analog mux bus B */
    P12_7_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P12_7_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P12_7_TCPWM0_LINE_COMPL7        =  8,       /* Digital Active - tcpwm[0].line_compl[7]:3 */
    P12_7_TCPWM1_LINE_COMPL7        =  9,       /* Digital Active - tcpwm[1].line_compl[7]:1 */
    P12_7_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:92 */
    P12_7_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:92 */
    P12_7_LCD_COM30                 = 12,       /* Digital Deep Sleep - lcd.com[30]:1 */
    P12_7_LCD_SEG30                 = 13,       /* Digital Deep Sleep - lcd.seg[30]:1 */
    P12_7_SDHC1_IO_VOLT_SEL         = 26,       /* Digital Active - sdhc[1].io_volt_sel */

    /* P13.0 */
    P13_0_GPIO                      =  0,       /* GPIO controls 'out' */
    P13_0_AMUXA                     =  4,       /* Analog mux bus A */
    P13_0_AMUXB                     =  5,       /* Analog mux bus B */
    P13_0_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P13_0_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P13_0_TCPWM0_LINE0              =  8,       /* Digital Active - tcpwm[0].line[0]:4 */
    P13_0_TCPWM1_LINE8              =  9,       /* Digital Active - tcpwm[1].line[8]:1 */
    P13_0_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:93 */
    P13_0_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:93 */
    P13_0_LCD_COM31                 = 12,       /* Digital Deep Sleep - lcd.com[31]:1 */
    P13_0_LCD_SEG31                 = 13,       /* Digital Deep Sleep - lcd.seg[31]:1 */
    P13_0_SCB6_UART_RX              = 18,       /* Digital Active - scb[6].uart_rx:1 */
    P13_0_SCB6_I2C_SCL              = 19,       /* Digital Active - scb[6].i2c_scl:1 */
    P13_0_SCB6_SPI_MOSI             = 20,       /* Digital Active - scb[6].spi_mosi:1 */
    P13_0_AUDIOSS1_CLK_I2S_IF       = 22,       /* Digital Active - audioss[1].clk_i2s_if:0 */
    P13_0_PERI_TR_IO_INPUT26        = 24,       /* Digital Active - peri.tr_io_input[26]:0 */
    P13_0_SDHC1_CARD_DAT_3TO00      = 26,       /* Digital Active - sdhc[1].card_dat_3to0[0] */

    /* P13.1 */
    P13_1_GPIO                      =  0,       /* GPIO controls 'out' */
    P13_1_AMUXA                     =  4,       /* Analog mux bus A */
    P13_1_AMUXB                     =  5,       /* Analog mux bus B */
    P13_1_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P13_1_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P13_1_TCPWM0_LINE_COMPL0        =  8,       /* Digital Active - tcpwm[0].line_compl[0]:4 */
    P13_1_TCPWM1_LINE_COMPL8        =  9,       /* Digital Active - tcpwm[1].line_compl[8]:1 */
    P13_1_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:94 */
    P13_1_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:94 */
    P13_1_LCD_COM32                 = 12,       /* Digital Deep Sleep - lcd.com[32]:1 */
    P13_1_LCD_SEG32                 = 13,       /* Digital Deep Sleep - lcd.seg[32]:1 */
    P13_1_SCB6_UART_TX              = 18,       /* Digital Active - scb[6].uart_tx:1 */
    P13_1_SCB6_I2C_SDA              = 19,       /* Digital Active - scb[6].i2c_sda:1 */
    P13_1_SCB6_SPI_MISO             = 20,       /* Digital Active - scb[6].spi_miso:1 */
    P13_1_AUDIOSS1_TX_SCK           = 22,       /* Digital Active - audioss[1].tx_sck:0 */
    P13_1_PERI_TR_IO_INPUT27        = 24,       /* Digital Active - peri.tr_io_input[27]:0 */
    P13_1_SDHC1_CARD_DAT_3TO01      = 26,       /* Digital Active - sdhc[1].card_dat_3to0[1] */

    /* P13.2 */
    P13_2_GPIO                      =  0,       /* GPIO controls 'out' */
    P13_2_AMUXA                     =  4,       /* Analog mux bus A */
    P13_2_AMUXB                     =  5,       /* Analog mux bus B */
    P13_2_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P13_2_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P13_2_TCPWM0_LINE1              =  8,       /* Digital Active - tcpwm[0].line[1]:4 */
    P13_2_TCPWM1_LINE9              =  9,       /* Digital Active - tcpwm[1].line[9]:1 */
    P13_2_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:95 */
    P13_2_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:95 */
    P13_2_LCD_COM33                 = 12,       /* Digital Deep Sleep - lcd.com[33]:1 */
    P13_2_LCD_SEG33                 = 13,       /* Digital Deep Sleep - lcd.seg[33]:1 */
    P13_2_SCB6_UART_RTS             = 18,       /* Digital Active - scb[6].uart_rts:1 */
    P13_2_SCB6_SPI_CLK              = 20,       /* Digital Active - scb[6].spi_clk:1 */
    P13_2_AUDIOSS1_TX_WS            = 22,       /* Digital Active - audioss[1].tx_ws:0 */
    P13_2_SDHC1_CARD_DAT_3TO02      = 26,       /* Digital Active - sdhc[1].card_dat_3to0[2] */

    /* P13.3 */
    P13_3_GPIO                      =  0,       /* GPIO controls 'out' */
    P13_3_AMUXA                     =  4,       /* Analog mux bus A */
    P13_3_AMUXB                     =  5,       /* Analog mux bus B */
    P13_3_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P13_3_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P13_3_TCPWM0_LINE_COMPL1        =  8,       /* Digital Active - tcpwm[0].line_compl[1]:4 */
    P13_3_TCPWM1_LINE_COMPL9        =  9,       /* Digital Active - tcpwm[1].line_compl[9]:1 */
    P13_3_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:96 */
    P13_3_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:96 */
    P13_3_LCD_COM34                 = 12,       /* Digital Deep Sleep - lcd.com[34]:1 */
    P13_3_LCD_SEG34                 = 13,       /* Digital Deep Sleep - lcd.seg[34]:1 */
    P13_3_SCB6_UART_CTS             = 18,       /* Digital Active - scb[6].uart_cts:1 */
    P13_3_SCB6_SPI_SELECT0          = 20,       /* Digital Active - scb[6].spi_select0:1 */
    P13_3_AUDIOSS1_TX_SDO           = 22,       /* Digital Active - audioss[1].tx_sdo:0 */
    P13_3_SDHC1_CARD_DAT_3TO03      = 26,       /* Digital Active - sdhc[1].card_dat_3to0[3] */

    /* P13.4 */
    P13_4_GPIO                      =  0,       /* GPIO controls 'out' */
    P13_4_AMUXA                     =  4,       /* Analog mux bus A */
    P13_4_AMUXB                     =  5,       /* Analog mux bus B */
    P13_4_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P13_4_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P13_4_TCPWM0_LINE2              =  8,       /* Digital Active - tcpwm[0].line[2]:4 */
    P13_4_TCPWM1_LINE10             =  9,       /* Digital Active - tcpwm[1].line[10]:1 */
    P13_4_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:97 */
    P13_4_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:97 */
    P13_4_LCD_COM35                 = 12,       /* Digital Deep Sleep - lcd.com[35]:1 */
    P13_4_LCD_SEG35                 = 13,       /* Digital Deep Sleep - lcd.seg[35]:1 */
    P13_4_SCB12_UART_RX             = 18,       /* Digital Active - scb[12].uart_rx:0 */
    P13_4_SCB12_I2C_SCL             = 19,       /* Digital Active - scb[12].i2c_scl:0 */
    P13_4_SCB6_SPI_SELECT1          = 20,       /* Digital Active - scb[6].spi_select1:1 */
    P13_4_AUDIOSS1_RX_SCK           = 22,       /* Digital Active - audioss[1].rx_sck:0 */
    P13_4_SDHC1_CARD_DAT_7TO40      = 26,       /* Digital Active - sdhc[1].card_dat_7to4[0] */

    /* P13.5 */
    P13_5_GPIO                      =  0,       /* GPIO controls 'out' */
    P13_5_AMUXA                     =  4,       /* Analog mux bus A */
    P13_5_AMUXB                     =  5,       /* Analog mux bus B */
    P13_5_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P13_5_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P13_5_TCPWM0_LINE_COMPL2        =  8,       /* Digital Active - tcpwm[0].line_compl[2]:4 */
    P13_5_TCPWM1_LINE_COMPL10       =  9,       /* Digital Active - tcpwm[1].line_compl[10]:1 */
    P13_5_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:98 */
    P13_5_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:98 */
    P13_5_LCD_COM36                 = 12,       /* Digital Deep Sleep - lcd.com[36]:1 */
    P13_5_LCD_SEG36                 = 13,       /* Digital Deep Sleep - lcd.seg[36]:1 */
    P13_5_SCB12_UART_TX             = 18,       /* Digital Active - scb[12].uart_tx:0 */
    P13_5_SCB12_I2C_SDA             = 19,       /* Digital Active - scb[12].i2c_sda:0 */
    P13_5_SCB6_SPI_SELECT2          = 20,       /* Digital Active - scb[6].spi_select2:1 */
    P13_5_AUDIOSS1_RX_WS            = 22,       /* Digital Active - audioss[1].rx_ws:0 */
    P13_5_SDHC1_CARD_DAT_7TO41      = 26,       /* Digital Active - sdhc[1].card_dat_7to4[1] */

    /* P13.6 */
    P13_6_GPIO                      =  0,       /* GPIO controls 'out' */
    P13_6_AMUXA                     =  4,       /* Analog mux bus A */
    P13_6_AMUXB                     =  5,       /* Analog mux bus B */
    P13_6_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P13_6_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P13_6_TCPWM0_LINE3              =  8,       /* Digital Active - tcpwm[0].line[3]:4 */
    P13_6_TCPWM1_LINE11             =  9,       /* Digital Active - tcpwm[1].line[11]:1 */
    P13_6_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:99 */
    P13_6_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:99 */
    P13_6_LCD_COM37                 = 12,       /* Digital Deep Sleep - lcd.com[37]:1 */
    P13_6_LCD_SEG37                 = 13,       /* Digital Deep Sleep - lcd.seg[37]:1 */
    P13_6_SCB12_UART_RTS            = 18,       /* Digital Active - scb[12].uart_rts:0 */
    P13_6_SCB6_SPI_SELECT3          = 20,       /* Digital Active - scb[6].spi_select3:1 */
    P13_6_AUDIOSS1_RX_SDI           = 22,       /* Digital Active - audioss[1].rx_sdi:0 */
    P13_6_SDHC1_CARD_DAT_7TO42      = 26,       /* Digital Active - sdhc[1].card_dat_7to4[2] */

    /* P13.7 */
    P13_7_GPIO                      =  0,       /* GPIO controls 'out' */
    P13_7_AMUXA                     =  4,       /* Analog mux bus A */
    P13_7_AMUXB                     =  5,       /* Analog mux bus B */
    P13_7_AMUXA_DSI                 =  6,       /* Analog mux bus A, DSI control */
    P13_7_AMUXB_DSI                 =  7,       /* Analog mux bus B, DSI control */
    P13_7_TCPWM0_LINE_COMPL3        =  8,       /* Digital Active - tcpwm[0].line_compl[3]:4 */
    P13_7_TCPWM1_LINE_COMPL11       =  9,       /* Digital Active - tcpwm[1].line_compl[11]:1 */
    P13_7_CSD_CSD_TX                = 10,       /* Digital Active - csd.csd_tx:100 */
    P13_7_CSD_CSD_TX_N              = 11,       /* Digital Active - csd.csd_tx_n:100 */
    P13_7_LCD_COM38                 = 12,       /* Digital Deep Sleep - lcd.com[38]:1 */
    P13_7_LCD_SEG38                 = 13,       /* Digital Deep Sleep - lcd.seg[38]:1 */
    P13_7_SCB12_UART_CTS            = 18,       /* Digital Active - scb[12].uart_cts:0 */
    P13_7_SDHC1_CARD_DAT_7TO43      = 26,       /* Digital Active - sdhc[1].card_dat_7to4[3] */

    /* USBDP */
    USBDP_GPIO                      =  0,       /* GPIO controls 'out' */

    /* USBDM */
    USBDM_GPIO                      =  0        /* GPIO controls 'out' */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC6_02_100_WLCSP_H_ */


/* [] END OF FILE */
